Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vtp domain ramoso.com.mx
Changing VTP domain name from NULL to ramoso.com.mx

Switch(config)#vtp mode server
Device mode already VTP SERVER.

Switch(config)#vtp password 1234
Setting device VLAN database password to 1234

Switch(config)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show vtp status
VTP Version                     : 2
Configuration Revision          : 0
Maximum VLANs supported locally : 255
Number of existing VLANs        : 5
VTP Operating Mode              : Server
VTP Domain Name                 : ramoso.com.mx
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Disabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x43 0xB1 0x1C 0x9D 0x9F 0x4A 0x13 0x06 
Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00
Local updater ID is 0.0.0.0 (no valid interface found)
Switch#
Switch#conf t
Switch(config)#int range g0/1-2
Switch(config-if-range)#sw mo tr

Switch#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
Switch#